In [9]:
import numpy as np
import pandas as pd
import warnings as wr
wr.filterwarnings('ignore')

In [10]:
df = pd.read_csv('supershops.csv') #load csv data set

In [11]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Marketing Spend  50 non-null     float64
 1   Administration   50 non-null     float64
 2   Transport        49 non-null     float64
 3   Area             50 non-null     object
 4   Profit           50 non-null     float64
dtypes: float64(4), object(1)
memory usage: 2.1+ KB

In [13]:
x = df.drop('Profit', axis=1) # drop target variable / 1 for column

In [14]:
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [15]:
y = df['Profit']

In [16]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

# Standard Scaler

In [18]:
#import standardscaler library 
from sklearn.preprocessing import StandardScaler
std = StandardScaler()

In [20]:
#transformation only feature , don't transform Y variable means target variable
df_ad = std.fit(df[['Administration']])

In [21]:
df_ad

StandardScaler()

In [22]:
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [23]:
df.Administration = std.transform(df[['Administration']])

In [24]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61        0.560753  471784.10    Dhaka  192261.83
1        162597.70        1.082807  443898.53      Ctg  191792.06
2        153441.51       -0.728257  407934.54  Rangpur  191050.39
3        144372.41       -0.096365  383199.62    Dhaka  182901.99
4        142107.34       -1.079919  366168.42  Rangpur  166187.94

In [25]:
df.Transport = std.fit_transform(df[['Transport']])

In [26]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61        0.560753   2.165287    Dhaka  192261.83
1        162597.70        1.082807   1.929843      Ctg  191792.06
2        153441.51       -0.728257   1.626191  Rangpur  191050.39
3        144372.41       -0.096365   1.417348    Dhaka  182901.99
4        142107.34       -1.079919   1.273550  Rangpur  166187.94

# LOOP Standard Scaler

In [28]:
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Marketing Spend  50 non-null     float64
 1   Administration   50 non-null     float64
 2   Transport        49 non-null     float64
 3   Area             50 non-null     object
dtypes: float64(3), object(1)
memory usage: 1.7+ KB

In [32]:
std = StandardScaler()

for column in x.columns:
    if  x.dtypes[column] != object:
        x[column] = std.fit_transform(x[[column]])

In [33]:
x.head()

   Marketing Spend  Administration  Transport     Area
0         0.897913        0.560753   2.165287    Dhaka
1         1.955860        1.082807   1.929843      Ctg
2         1.754364       -0.728257   1.626191  Rangpur
3         1.554784       -0.096365   1.417348    Dhaka
4         1.504937       -1.079919   1.273550  Rangpur

# MinMax Scaler

In [34]:
from sklearn.preprocessing import MinMaxScaler

min_max_scale = MinMaxScaler()
df['Marketing Spend'] = min_max_scale.fit_transform(df[['Marketing Spend']])

In [35]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.560753   2.165287    Dhaka  192261.83
1         0.983359        1.082807   1.929843      Ctg  191792.06
2         0.927985       -0.728257   1.626191  Rangpur  191050.39
3         0.873136       -0.096365   1.417348    Dhaka  182901.99
4         0.859438       -1.079919   1.273550  Rangpur  166187.94

In [36]:
#Max Abs Scaler

In [37]:
from sklearn.preprocessing import MaxAbsScaler

max_abs_scale = MaxAbsScaler()
df['Marketing Spend'] = max_abs_scale.fit_transform(df[['Marketing Spend']])

In [38]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.560753   2.165287    Dhaka  192261.83
1         0.983359        1.082807   1.929843      Ctg  191792.06
2         0.927985       -0.728257   1.626191  Rangpur  191050.39
3         0.873136       -0.096365   1.417348    Dhaka  182901.99
4         0.859438       -1.079919   1.273550  Rangpur  166187.94

# Robus Scaler

In [39]:
from sklearn.preprocessing import RobustScaler

In [40]:
robust_Scaler = RobustScaler()

In [41]:
df['Marketing Spend'] = robust_Scaler.fit_transform(df[['Marketing Spend']])

In [42]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.672530        0.560753   2.165287    Dhaka  192261.83
1         1.452113        1.082807   1.929843      Ctg  191792.06
2         1.303634       -0.728257   1.626191  Rangpur  191050.39
3         1.156567       -0.096365   1.417348    Dhaka  182901.99
4         1.119836       -1.079919   1.273550  Rangpur  166187.94

# Loop

In [44]:
df = pd.read_csv('supershops.csv') #load csv data set

In [46]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [54]:
rs = RobustScaler()
x = df.drop('Profit', axis=1) # drop target variable / 1 for column
for column in x.columns:
    if  x.dtypes[column] != object:
        df[column] = rs.fit_transform(df[[column]])

In [56]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.672530        0.345355   1.552016    Dhaka  192261.83
1         1.452113        0.697565   1.383714      Ctg  191792.06
2         1.303634       -0.524290   1.166654  Rangpur  191050.39
3         1.156567       -0.097977   1.017368    Dhaka  182901.99
4         1.119836       -0.761543   0.914576  Rangpur  166187.94